Repository: mozilla-l10n/mt-training-data
Catalog: ig/ig_pontoon.tmx
Source language: en_us
Languages: ig

source: Active Contributors
ig: Ndị Nkwado Dị Ire

source: Add
ig: Tinye

source: Add and configure your email accounts on Thunderbird
ig: Tinye ma hazie akaụntụ email gị na Thunderbird

source: Add announcement
ig: Tinye amamọkwa

source: Add Contributor
ig: Tinye Onye Nkwado

source: Add Editor
ig: Tinye Onye Ndezi

source: Add group profile
ig: Tinye profaịlụ otu

source: Add images:
ig: Tinye onyonyo:

source: Additional System Details
ig: Mgbakwunye Nkọwapụta Sistemụ

source: Add Leader
ig: Tinye Onye Isi

source: Add Member
ig: Tinye Onye Otu

source: Add Reviewer
ig: Tinye Onye Nyocha

source: Administration
ig: Nchịkwa

source: Administrator
ig: Onye nchịkwa

source: A document with this slug already exists in this locale.
ig: Dọkụmentị nwere slọọg a adịlarịị adị na mpaghara a.

source: A document with this title already exists in this locale.
ig: Dọkụmentị nwere aha a adịlarịị adị na mpaghara a.

source: Advanced Search
ig: Ọchụchọ Dị Elu

source: Advanced Search Results
ig: Nsonaazụ Ọchụchọ Dị Elu

source: A few times a week
ig: Ugboro ole ma ole n'otu izu

source: Affects search results
ig: Na emetụta nsonaazụ ọchụchọ

source: After
ig: Agachaa

source: A fully translated user interface improves the experience for site visitors in your language. Help <a href="%(url)s">translate the interface</a>.
ig: Ihu onye ọrụ atụgharịrị n'uju na emelite ahụmịhe maka ndị mbịambịa saịtị n'asụsụ gị. Nyere aka<a href="%(url)s">tụgharịa asụsụ ihu ahụ</a>.

source: Aggregated Localization Metrics
ig: Metrik Ntụgharị Asụsụ Achịkọtara Ọnụ

source: Aggregated Metrics
ig: Metrik Achịkọtara

source: <a href="{reply_url}">last reply</a> by <a href="{user_url}">{username}</a> {when}
ig: <a href="{reply_url}">nzaghachi ikpeazụ</a> n'aka <a href="{user_url}">{username}</a> {when}

source: <a href="%(thread_url)s">%(thread_title)s</a><br> in <a href="%(document_discussion_url)s">%(document)s</a>
ig: <a href="%(thread_url)s">%(thread_title)s</a><br> na <a href="%(document_discussion_url)s">%(document)s</a>

source: <a href="%(url)s">Forum Contributor</a> - Answer user support questions that are most-requested but have no replies.
ig: <a href="%(url)s">Onye Nkwado Ọgbakọ</a> - Zaa ajụjụ nkwado onye ọrụ ndị akachasị chọọ mana na enweghị nzaghachi.

source: <a href="%(url)s">KB Editor</a> - Help to update knowledge base articles that need changes or write new articles.
ig: <a href="%(url)s">Ihe Ndezi KB</a> - Nyere aka melite edemede ọdụ nghọta kwesịrị mgbanwe ma ọ bụ dee edemede ọhụrụ.

source: <a href="%(url)s">L10N Contributor</a> - Help to translate Firefox Help content to your language.
ig: <a href="%(url)s">Onye Nkwado L10N</a> - Nyere aka tụgharịa asụsụ ọdịnaya Enyemaka Firefox n'asụsụ gị.

source: <a href="%(url)s">Twitter Contributor</a> - Respond to tweets about Firefox.
ig: <a href="%(url)s">Onye Nkwado Twitter</a> - Zaghachi twiit gbasara Firefox.

source: algorithm
ig: usoro

source: All Administration articles...
ig: Edemede Nchịkwa niile...

source: All Articles
ig: Edemede Niile

source: All articles requiring review...
ig: Edemede niile chọrọ nyocha...

source: All articles that require changes...
ig: Edemede niile chọrọ mgbanwe...

source: All articles with changes not ready for localization...
ig: Edemede niile nwere mgbanwe na adịghị nkwadobe maka ntụgharị asụsụ...

source: All available SUMO badges
ig: Akara SUMO niile dị

source: All canned responses articles...
ig: Edemede nzaghachi niile ezubere iche...

source: All How To Contribute articles...
ig: Edemede Otu Esi Etinye Aka niile...

source: All knowledge base articles...
ig: Edemede ọdụ nghọta niile...

source: All Knowledge Base Articles
ig: Edemede Ọdụ Nghọta Niile

source: All locales
ig: Mpaghara Niile

source: Allow discussion on this article?
ig: Hapụ mkparịta ụka n'edemede a?

source: Allow translations:
ig: Hapụ ntụgharị asụsụ:

source: All posts
ig: Mbisa niile

source: All products
ig: Ngwaahịa niile

source: All Products
ig: Ngwaahịa Niile

source: All questions
ig: Ajụjụ niile

source: All templates...
ig: Ndebiri niile...

source: All Time
ig: Oge Niile

source: All Topics
ig: Isiokwu Niile

source: All translations...
ig: Ntụgharị asụsụ niile...

source: All translations of this document will also be deleted.
ig: A ga-ehichapụkwa ntụgharị asụsụ nke dọkụmentị a niile.

source: All unhelpful articles...
ig: Edemede niile na abaghị uru...

source: Almost there! We just need you to create a support forum account!
ig: Ntakịrị ihe fọdụrụ! Anyị chọrọ ka ị mepụta akaụntụ ọgbakọ nkwado!

source: Already have an account? Sign in
ig: Ịnweela akaụntụ? Banye

source: An email has been sent to the address below:
ig: Ezigala email na adreesị ahụ dị n'okpuru:

source: An error occured.
ig: Mperi dapụtara.

source: An error occured: {message}
ig: Mperi dapụtara: {message}

source: An Error Occurred
ig: Mperi Dapụtara

source: A newer revision has already been reviewed.
ig: Enyochaala ngụgharị ka ọhụrụ.

source: A newer version has already been reviewed.
ig: Enyochaala ngụgharị ka ọhụrụ ahụ.

source: A new online standard to recognize and verify learning
ig: Ọkọlọtọ n'ịntanetị ọhụrụ iji mata ma nyochaa ọmụmụ

source: A new window will open. Click on a button called <em>Copy text to clipboard</em>.
ig: Mpio ọhụrụ ga-emepe. Pịa bọtịnụ akpọrọ <em>Ṅomie ederede na klipbọọdụ</em>.

source: Answered
ig: Azara

source: answered by <a href="{user_url}">{username}</a> {when}
ig: azịza si n'aka <a href="{user_url}">{username}</a> {when}

source: {answerer} commented on a Firefox question on {host}:
ig: {answerer} dere ihe na ajụjụ Firefox na {host}:

source: {answerer} has posted an answer to your question on {host}:
ig: {answerer} ebisala azịza maka ajụjụ gị na {host}:

source: {answerer} wrote:
ig: {answerer} dere:

source: Answer questions in the forum
ig: Zaa ajụjụ n'ọgbakọ ahụ

source: Answer questions in the support forum
ig: Zaa ajụjụ ndị dị n'ọgbakọ nkwado

source: Answers didn't help
ig: Azịza enyeghị aka

source: Answer to Twitter users that need help. It's super easy with our canned responses.
ig: Zaa ndị ọrụ Twitter chọrọ enyemaka. Ọ dị oke mfe site na iji nzaghachi anyị ezubere iche.

source: Answer Votes: % Helpful
ig: Ntuli Aka Azịza: % Bara Uru

source: Application
ig: Ngwa

source: Application Issues
ig: Nsogbu Ngwa

source: Applications
ig: Ngwa

source: Approved
ig: Akwadoro

source: Approved {default_locale} version:
ig: Ụdị {default_locale} akwadoro:

source: Approve Revision
ig: Kwado Ngụgharị

source: Approve Translation
ig: Kwado Ntụgharị Asụsụ

source: Archived
ig: Echekwara

source: Archive this question
ig: Chekwaa ajụjụ a

source: A request was received to reset the password for this account on %(sitename)s. To change this password please click on the following link, or paste it into your browser's location bar:
ig: Enwetara arịrịọ iji tọgharịa okwuntughe maka akaụntụ a na %(sitename)s. Iji gbanwee okwuntughe a biko pịa njikọ ndị a, ma ọ bụ mado ya n'ime ogwe ọnọdụ nke ihe nchọgharị gị:

source: A revision must be based on the English article. Revision ID %(id)s does not fit this criterion.
ig: Ngụgharị ga-adaberịrị na edemede Bekee. ID ngụgharị %(id)s amakọghị na njirisi a.

source: A revision you contributed to has been approved. %(reviewer)s has approved a revision to the document %(document_title)s.
ig: Akwadola ngụgharị ị nyere. %(reviewer)s akwadola ngụgharị maka dọkụmentị %(document_title)s.

source: A revision you contributed to has been approved: {title}
ig: Akwadola ngụgharị ị nyere: {title}

source: A revision you contributed to has been reviewed. %(reviewer)s has reviewed a revision to the document %(document_title)s.
ig: Enyochaala ngụgharị ị nyere. %(reviewer)s enyochaala ngụgharị maka dọkụmentị %(document_title)s.

source: A revision you contributed to has been reviewed: {title}
ig: Enyochaala ngụgharị ị nyere: {title}

source: Are you registered with Mozilla Support?
ig: Ị bụ onye Nkwado Mozilla debanyere aha?

source: Are you sure
ig: O doro gị anya

source: Are you sure you want to delete the {group} group avatar?
ig: O doro gị anya na ị chọrọ ihichapụ nghọrọ otu {group}?

source: Are you sure you want to delete these messages?
ig: O doro gị anya na ị chọrọ ihichapụ ozi ndị a?

source: Are you sure you want to delete this answer?
ig: O doro gị anya na ị chọrọ ihichapụ azịza a?

source: Are you sure you want to delete this document?
ig: O doro gị anya na ị chọrọ ihichapụ dọkụmentị a?

source: Are you sure you want to delete this image?
ig: O doro gị anya na ị chọrọ ihichapụ onyonyo a?

source: Are you sure you want to delete this message?
ig: O doro gị anya na ị chọrọ ihichapụ ozi a?

source: Are you sure you want to delete this post?
ig: O doro gị anya na ị chọrọ ihichapụ mbisa a?

source: Are you sure you want to delete this question?
ig: O doro gị anya na ị chọrọ ihichapụ ajụjụ a?

source: Are you sure you want to delete this revision?
ig: O doro gị anya na ị chọrọ ihichapụ ngụgharị a?

source: Are you sure you want to delete this thread?
ig: O doro gị na ị chọrọ ihichapụ usoro a?

source: Are you sure you want to delete this video?
ig: O doro gị anya na ị chọrọ ihichapụ vidio a?

source: Are you sure you want to delete your avatar?
ig: O doro gị anya na ị chọrọ ihichapụ nghọrọ gị?

source: Are you sure you want to remove {user}?
ig: O doro gị na ị chọrọ iwepu {user}?

source: Are you sure you want to remove {user} from {group}?
ig: O doro gị anya na ị chọrọ iwepu {user} n'ime {group}?

source: Are you sure you want to remove {user} from {group} leaders?
ig: O doro gị anya na ị chọrọ iwepu {user} n'ime ndị isi {group}?

source: Are you sure you want to remove {user} from the document contributors?
ig: O doro gị anya na ị chọrọ iwepu {user} na ndị nkwado dọkụmentị ahụ?

source: Are you sure you want to unsubscribe?
ig: O doro gị na ị chọrọ iwepu aha?

source: Army of Awesome
ig: Igwe Ọmarịcha Ihe

source: Army Of Awesome
ig: Igwe Ọmarịcha Ihe

source: Army of Awesome: help users on Twitter
ig: Igwe Ọmarịcha Ihe: nyere ndị ọrụ aka na Twitter

source: Army of Awesome will never tweet without your permission.
ig: Igwe Ọmarịcha Ihe agaghị ebisa twiit na ejighi ikikere gị.

source: Article
ig: Edemede

source: Article contains
ig: Edemede nwere

source: Article Discussions
ig: Mkparịta Ụka Edemede

source: Article is for:
ig: Edemede maka:

source: Article Revisions
ig: Ngụgharị Edemede

source: Articles
ig: Edemede

source: Articles that require changes.
ig: Edemede ndị chọrọ mgbanwe.

source: Articles that tell you how you can do more with Thunderbird
ig: Edemede ndị na agwa gị otu ị nwere ike isi mekwuo ihe na Thunderbird

source: Articles which have approved revisions newer than the latest ready-for-localization one
ig: Edemede ndị nwere ngụgharị ka ọhụrụ karịa nke dị nkwadobe-maka-ntụgharị asụsụ kachasị ọhụrụ

source: Article URL
ig: URL nke edemede

source: Article Votes: % Helpful
ig: Ntuli Aka Ederede: % Bara Uru

source: Ask a New Question
ig: Jụọ Ajụjụ Ọhụrụ

source: Ask a question
ig: Jụọ ajụjụ

source: Ask a Question
ig: Jụọ Ajụjụ

source: Ask A Question
ig: Jụọ Ajụjụ

source: Ask a Question about Marketplace
ig: Jụọ Ajụjụ gbasara Ọdụ ahịa

source: asked by <a href="{user_url}">{username}</a> {when}
ig: ajụjụ si n'aka <a href="{user_url}">{username}</a> {when}

source: Ask other contributors
ig: Jụọ ndị nkwado ndị ọzọ

source: Ask this
ig: Jụọ nke a

source: Ask your question to our community of users
ig: Jụọ ajụjụ gị n'ogbe nke ndị ọrụ anyị

source: A small box will open. Click on an item called <em>Troubleshooting Information</em>.
ig: Obere igbe ga-emepe. Pịa n'otu ihe akpọrọ <em>Ozi Nchọpụta Nsogbu</em>.

source: A small box will open. Click on the item called <em>Paste</em>. Alternatively, type <em>Ctrl+V</em> or <em>Command+V</em>.
ig: Obere igbe ga-emepe. Pịa na ihe akpọrọ <em>Mado</em>. Otu aka ọzọ, pịnye <em>Ctrl+V</em> ma ọ bụ <em>Ntimiwu+V</em>.

source: A support account lets us alert you when people respond to your question.
ig: Akaụntụ nkwado na enye anyị ohere izitere gị ozi mgbe ndị mmadụ zaghachiri ajụjụ gị.

source: As you get started answering questions that look easy you might run into a few questions. Like, what happens when an angry user does not want a work around or what happens next? The Contributor Quality Training may have these answered. It is possible to get started here:
ig: Ka i bidoro ịza ajụjụ ndị dị mfe n'anya ị nwere ike ịdabanye n'ajụjụ ole ma ole. Dịka, gịnị na eme mgbe onye ọrụ iwe na ewe achọghị ịchọ ụzọ ọzọ ma ọ bụ gịnị na esote? Ọzụzụ Ogo Onye Nkwado nwere ike ịnwe azịza ndị a. E nwere ike ibido ebe a:

source: As you get started answering questions that look easy you might run into a few questions. Like, what happens when an angry user does not want a work around or what happens next? The Contributor Quality Training may have these answered. It is possible to get started here: <a href="%(url)s">Contributor Quality Training</a>.
ig: Ka i bidoro ịza ajụjụ ndị dị mfe n'anya ị nwere ike ịdabanye n'ajụjụ ole ma ole. Dịka, gịnị na eme mgbe onye ọrụ iwe na ewe achọghị ịchọ ụzọ ọzọ ma ọ bụ gịnị na esote? Ọzụzụ Ogo Onye Nkwado nwere ike ịnwe azịza ndị a. E nwere ike ibido ebe a: <a href="%(url)s">Ọzụzụ Ogo Onye Nkwado</a>.

source: At least one number and one English letter are required in the password.
ig: Achọrọ opekata mpe otu nọmba na mkpụrụedemede Bekee n'okwuntughe ahụ.

source: Attached screenshots
ig: Nseta ihuenyo ndị agbakwunyere

source: Attention needed
ig: Achọrọ ntinye uche

source: Attention Needed
ig: Achọrọ Ntinye Uche

source: A user with that email address already exists.
ig: Onye ọrụ nwere adreesị email ahụ adịlarịị adị.

source: Author
ig: Ọdee

source: %(author)s has posted a new thread in a forum you're watching. Here is the thread:
ig: %(author)s ebisala usoro ọhụrụ n'ọgbakọ ị na elele. Nke a bụ usoro ahụ:

source: %(author)s has replied to a thread you're watching. Here is their reply:
ig: %(author)s azaghachiela usoro ị na elele. Nke a bụ nzaghachi ha:

source: Automatically add
ig: Tinye na akpaghị aka

source: Avatar:
ig: Nghọrọ:

source: Award details
ig: Nkọwa nrite

source: Awarded badge: %(badge_name)s
ig: Akara enyere: %(badge_name)s

source: Awarded by:
ig: Enyere site n'aka:

source: awarded to
ig: e nyere

source: Awarded to:
ig: E nyere:

source: Awarded to support contributors who contributed (KB article documentation, answering Forum Questions, localizing KB article documentation, tweets, etc) to the launch of Firefox 29, thanks! Firefox 29 features: 1. Firefox Desktop: Australis new look and feel AND Firefox Accounts based sync 2. Firefox for Android: Firefox Accounts based sync MOAR: https://sumo.etherpad.mozilla.org/sumo-australis-badges
ig: A na enye iji kwado ndị nkwado ndị wetara (akwụkwọ edemede KB, ịza Ajụjụ Ọgbakọ, ịtụgharị asụsụ akwụkwọ edemede KB, twiit, wdg) ruo na mbido nke Firefox 29, daalụ! Atụmatụ Firefox 29: 1. Deskọpụ Firefox: Nhụta na mmetụta ọhụrụ Australis NA Akaụntụ Firefox dabere na mmekọrịta 2. Firefox maka Android: Akaụntụ Firefox dabere na mmekọrịta MOAR: https://sumo.etherpad.mozilla.org/sumo-australis-badges

source: %(awarder)s has awarded you the %(title)s badge!
ig: %(awarder)s enyela gị akara %(title)s!

source: A window will open in the top corner. Click Allow, and then click Install. If the automated way doesn't work, <a class="expander" href="%(url)s">try these manual steps</a>.
ig: Otu mpio ga-emepe n'isi akụkụ elu. Pịa Hapụ, wee pịa Wụnye. Ọ bụrụ na ụzọ akpaka arụghị ọrụ, <a class="expander" href="%(url)s">nwalee usoro ndị a eji aka eme</a>.

source: Back to:
ig: Laghachi na:

source: Back to History
ig: Laghachi na Ndekọ

source: Badge awarded to those who have contributed to the Kitsune code base.
ig: Akara enyere ndị tinyegoro aka na ọdụ koodu Kitsune.

source: Badge: %(badge_name)s
ig: Akara: %(badge_name)s

source: BadgeKit
ig: NgwungwuAkara

source: Badges
ig: Akara

source: Ban
ig: Machie

source: Banned Users
ig: Ndị Ọrụ Amachiri

source: Ban User
ig: Machie Onye Ọrụ

source: Ban user will prevent a given twitter handle from using the Army of Awesome tool.
ig: Ịmachi onye ọrụ ga-egbochi aha njirimara na twitter na iji ngwaọrụ Igwe Ọmarịcha Ihe.

source: Basic browsing
ig: Ntọala nchọgharị

source: Basic Features
ig: Atụmatụ Ntọala

source: Basics to get started with Firefox for Windows 8 Touch.
ig: Ntọala iji bido na Firefox maka Windows 8 Touch.

source: Be descriptive. Saying &quot;Playing video on YouTube is always choppy&quot; will help our volunteers identify your problem better than saying &quot;Something is wrong&quot; or &quot;Firefox is broken&quot;.
ig: Mee nkọwa nke ọma. Ikwu &quot;Ịkpọ vidio na YouTube na esikarị ike&quot; ga-enyere ndị mwepụta obi anyị aka ịchọpụta nsogbu gị karịa ikwu &quot;Ọnwere ihe n adịghị mma&quot; ma ọ bụ &quot;Firefox emebiela&quot;.

source: Before
ig: Tupu

source: Before we update your email, you must confirm it. Please click the link below or copy and paste the whole thing into your browser's location bar:
ig: Tupu anyị emelite email gị, ị ga-ekwenyerịrị na ya. Biko pịa njikọ dị n'okpuru ma ọ bụ ṅomie wee mado ihe ahụ niile n'ime ogwe ọnọdụ nke ihe nchọgharị gị:

source: Before you can log in, you need to confirm your email address. We've sent you an email with a confirmation link in it. Just click the link and you'll be ready to go!
ig: Tupu ị nwee ike ịbanye, ị ga-ekwenye na adreesị email gị. Anyị zigara gị email nwere njikọ nkwenye na ya. Pịa njikọ ahụ, ị ga-adị njikere ibido!

source: Before you connect to Twitter, you must sign in to Mozilla Support.
ig: Tupu i jikọọ na Twitter, ị ga-abanyerịrị na Nkwado Mozilla.

source: Before you join, you need to give Army of Awesome the permission to post tweets on your behalf.
ig: Tupu i sonye, ị ga-enye Igwe Ọmarịcha Ihe ikikere iji bisa twiit na nnọchite gị.

source: Below is a list of items that you have watched. Checked items are items you are currently watching and unchecked items are no longer being watched.
ig: N'okpuru bụ ndepụta nke ihe ndị ị lelere. Ihe ndị akapụtara bụ ihe ndị ị na elele ugbu a, anaghịzị elele ihe ndị akapụtaghị.

source: Be nice. Our volunteers are Mozilla users just like you, who take the time out of their day to help.
ig: Mee ezi omume. Ndị mwepụta obi anyị bụ ndị ọrụ Mozilla dị ka gị, ndị na ewepụta oge n'ụbọchị ha iji nyere aka.

source: Bio
ig: Akụkọ ndụ mmadụ

source: Biography
ig: Akụkọ ndụ mmadụ

source: Body:
ig: Ahụ:

source: Bold
ig: Ọkpụrụkpụ

source: bold text
ig: ederede ọkpụrụkpụ

source: Bookmark options
ig: Nhọrọ bukumakị

source: Bookmarks
ig: Bukumakị

source: Bookmarks and tabs
ig: Bukumakị na taabụ

source: Briefly describe your changes:
ig: Kọwaa mgbanwe gị obere:

source: Browse for an image to upload.
ig: Chọgharịa onyonyo a ga-ebugo.

source: Browse for unsolved questions and help a fellow user
ig: Chọgharịa ajụjụ ndị asabeghị ma nyere onye ọrụ ibe gị aka

source: Browse for unsolved questions and help a Firefox user
ig: Chọgharịa ajụjụ ndị ekpezibeghị ma nyere onye ọrụ Firefox aka

source: browserID
ig: IDihe nchọgharị

source: Browse the questions for all the products together in one list.
ig: Chọgharịa ajụjụ gbasara ngwaahịa niile n'otu ndepụta.

source: Bulleted List
ig: Ndepụta Nwere Ntụpọ

source: Bulleted list item
ig: Ihe ndepụta nwere ntụpọ

source: Button of type "%s" does not exist.
ig: Bọtịnụ nke ụdị "%s" adịghị adị.

source: by <a class="username" href="{profile_url}">{username}</a>
ig: nke <a class="username" href="{profile_url}">{username}</a>

source: by <a href="{profile_url}">{user}</a>
ig: nke <a href="{profile_url}">{user}</a>

source: by {user}
ig: nke {user}

source: Calendar
ig: Kalịnda

source: Calling and Contacts
ig: Ọkpụkpọ na Kọntaktị

source: Cancel and go back to document history
ig: Kagbuo ma laghachi na ndekọ dọkụmentị

source: Cancel Review
ig: Kagbuo Nyocha

source: cannedresponses
ig: nzaghachi ndị ezubere iche

source: Canned Responses
ig: Nzaghachi Ndị Ezubere Iche

source: Can't find an answer? Summarize your question in a sentence.
ig: Enweghị ike ịchọta azịza? Chịkọta ajụjụ gị n'ime otu ahịrịokwu.

source: Cast to your TV
ig: Tụnye na TV gị

source: Category
ig: Otu

source: Category:
ig: Otu:

source: change
ig: gbanwee

source: Change
ig: Gbanwee

source: Change avatar
ig: Gbanwee nghọrọ

source: Change Avatar
ig: Gbanwee Nghọrọ

source: change category
ig: gbanwee otu

source: Changed
ig: Agbanwere

source: changed by {users}
ig: nke {users} gbanwere

source: Change email
ig: Gbanwee email

source: Change Email
ig: Gbanwee Email

source: Change email address
ig: Gbanwee adreesị email

source: Change {group} group avatar
ig: Gbanwee nghọrọ otu {group}

source: Change how Firefox handles videos, animations, music and other interactive content
ig: Gbanwee otu Firefox si ejikwa vidio, eserese, egwu na ọdịnaya nkwukọrịta ndị ọzọ

source: Change my email
ig: Gbanwee email m

source: Change my password
ig: Gbanwee okwuntughe m

source: Change password
ig: Gbanwee okwuntughe

source: Change Password
ig: Gbanwee Okwuntughe

source: change product
ig: gbanwee ngwaahịa

source: Change Revisions
ig: Gbanwee Ngụgharị

source: Changes:
ig: Mgbanwe:

source: Changes Needed
ig: Achọrọ Mgbanwe

source: Changes Not Ready For Localization
ig: Mgbanwe Adịghị Nkwadobe Maka Ntụgharị Asụsụ

source: Change your email preferences
ig: Gbanwee mmasị email gị

source: Change your email preferences:
ig: Gbanwee mmasị email gị:

source: Change your history settings on Firefox for iOS
ig: Gbanwee ntọala ndekọ gị na Firefox maka iOS

source: characters remaining.
ig: mkpụrụedemede fọdụrụ.

source: Chat and share
ig: Nkata na nkekọrịta

source: Check our documentation
ig: Lelee ndekọ anyị

source: Choose a tweet below
ig: Họrọ twiit n'okpuru

source: Choose revisions to compare
ig: Họrọ ngụgharị iji tụlee

source: Chosen solution
ig: Asịsa ahọpụtara

source: Chosen Solution
ig: Asịsa Ahọpụtara

source: City
ig: Obodo

source: Click here to find out where to help.
ig: Pịa ebe a iji chọpụta ebe ị ga-enyere aka.

source: Click here to verify your email address
ig: Pịa ebe a iji nyochaa adreesị email gị

source: Clicking Accept will make this version of the article live! Please take a moment to be sure all options are correct.
ig: Ịpị Nabata ga-eme ka ụdị nke edemede a dị ire! Biko were obere oge iji hụ na nhọrọ niile ziri ezi.

source: Click on the empty box above this text.
ig: Pịa igbe ghe oghe dị n'elu nke ederede a.

source: Clickthrough rate
ig: Ogo mpịfere

source: Click Through Rate %
ig: Pịgharịa N'ime Ogo %

source: Click to register.
ig: Pịa iji debanye aha.

source: Click to sign in.
ig: Pịa iji banye.

source: Close account and delete all profile information
ig: Mechie akaụntụ ma hichapụ ozi profaịlụ niile

source: Close Diff
ig: Mechie Ndịiche

source: Collect and retain information only when it is necessary to a project or task.
ig: Nakọta ma dowe ozi naanị mgbe ọ dị mkpa maka arụmarụ ma ọ bụ ọrụ.

source: Comment:
ig: Asịsa:

source: Common responses
ig: Nzaghachi ndị a na enwekarị

source: Community Discussion Only
ig: Naanị Mkparịta Ụka Ogbe

source: Community Discussions
ig: Mkparịta Ụka Ogbe

source: Community forums
ig: ọgbakọ ogwe anyị

source: Community Hub
ig: Etiti Ogbe

source: Community Search Results
ig: Nsonaazụ Ọchụchọ Ogbe

source: Compare Revisions
ig: Tụlee Ngụgharị

source: Compare Revisions | {document}
ig: Tulee Ngụgharị | {document}

source: Compare Selected Revisions
ig: Tụlee Ngụgharị Ndị Ahọpụtara

source: Compare Selected Translations
ig: Tụlee Ntụgharị Asụsụ Ndị Ahọpụtara

source: Complete overview...
ig: Nchịkọta zuru oke...

source: Confirmation email sent
ig: Ezipuru email nkwenye

source: Confirmation email sent successfully.
ig: Ezipuru email nkwenye na enweghị nsogbu.

source: Confirm password
ig: Kwenye na okwuntughe

source: Confirm registration
ig: Kwenye na ndebanye
